In [2]:
import numpy as np
import pandas as pd

In [4]:
from sklearn.model_selection import train_test_split,cross_val_score
from sklearn.tree import DecisionTreeClassifier

from sklearn.metrics import accuracy_score

from sklearn.compose import ColumnTransformer

In [14]:
df = pd.read_csv('train.csv')[['Age','Fare','SibSp','Parch','Survived']]

In [16]:
df.head()

    Age     Fare  SibSp  Parch  Survived
0  22.0   7.2500      1      0         0
1  38.0  71.2833      1      0         1
2  26.0   7.9250      0      0         1
3  35.0  53.1000      1      0         1
4  35.0   8.0500      0      0         0

In [18]:
df.dropna(inplace = True)

In [20]:
df.head()

    Age     Fare  SibSp  Parch  Survived
0  22.0   7.2500      1      0         0
1  38.0  71.2833      1      0         1
2  26.0   7.9250      0      0         1
3  35.0  53.1000      1      0         1
4  35.0   8.0500      0      0         0

In [22]:
df['family'] = df['SibSp'] + df['Parch']

In [24]:
df.head()

    Age     Fare  SibSp  Parch  Survived  family
0  22.0   7.2500      1      0         0       1
1  38.0  71.2833      1      0         1       1
2  26.0   7.9250      0      0         1       0
3  35.0  53.1000      1      0         1       1
4  35.0   8.0500      0      0         0       0

In [28]:
df.drop(columns=['SibSp','Parch'],inplace=True)

In [30]:
df.head()

    Age     Fare  Survived  family
0  22.0   7.2500         0       1
1  38.0  71.2833         1       1
2  26.0   7.9250         1       0
3  35.0  53.1000         1       1
4  35.0   8.0500         0       0

In [34]:
X = df.drop(columns=['Survived'])
y = df.iloc[:,2]

In [36]:
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.2,random_state=42)

In [38]:
X_train.head()

      Age     Fare  family
328  31.0  20.5250       2
73   26.0  14.4542       1
253  30.0  16.1000       1
719  33.0   7.7750       0
666  25.0  13.0000       0

In [42]:
# Without binarization

clf = DecisionTreeClassifier()
clf.fit(X_train,y_train)

y_pred = clf.predict(X_test)

accuracy_score(y_test,y_pred)

0.6433566433566433

In [44]:
np.mean(cross_val_score(clf,X,y,cv=10,scoring='accuracy'))

0.6414514866979657

In [46]:
# Applying Binarization

from sklearn.preprocessing import Binarizer

In [76]:
trf = ColumnTransformer([('bin',Binarizer(copy=False),['family'])],remainder = 'passthrough')

🔹 ```'bin'``` → এটা শুধু একটা নাম, যা ```Binarizer``` ট্রান্সফরমারকে চিহ্নিত করতে সাহায্য করবে।

🔹 ```Binarizer(copy=False)``` → ```family``` কলামের সব ভ্যালুকে ```০``` বা ```১```-এ রূপান্তর করবে।

যদি মান নির্দিষ্ট থ্রেশহোল্ড (ডিফল্ট ```০.০```) এর চেয়ে বড় হয়, তাহলে ```১```।
নাহলে ```০```।

🔹 ```['family']``` → শুধু ```family``` কলামে এই পরিবর্তন হবে।

🔹 ```remainder='passthrough'``` → বাকি কলামগুলো আগের মতোই থাকবে, কোনো পরিবর্তন হবে না।

In [79]:
X_train_trf = trf.fit_transform(X_train)
X_test_trf = trf.transform(X_test)

In [81]:
pd.DataFrame(X_train_trf,columns=['family','Age','Fare'])

     family   Age      Fare
0       1.0  31.0   20.5250
1       1.0  26.0   14.4542
2       1.0  30.0   16.1000
3       0.0  33.0    7.7750
4       0.0  25.0   13.0000
..      ...   ...       ...
566     1.0  46.0   61.1750
567     0.0  25.0   13.0000
568     0.0  41.0  134.5000
569     1.0  33.0   20.5250
570     0.0  33.0    7.8958

[571 rows x 3 columns]

In [89]:
clf = DecisionTreeClassifier()
clf.fit(X_train_trf,y_train)
y_pred2 = clf.predict(X_test_trf)

accuracy_score(y_test,y_pred2)

0.5944055944055944

In [91]:
X_trf = trf.fit_transform(X)
np.mean(cross_val_score(DecisionTreeClassifier(),X_trf,y,cv=10,scoring='accuracy'))

0.6219874804381847